[
  {
    "section_id": "A.2",
    "text": "This SOW will address requirements for transition from the existing NLRB services that are currently under the Circuit Switched Voice Service (CSVS) section of the GSA EIS contract.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "Service"
  },
  {
    "section_id": "A.3",
    "text": "NLRB currently has the following existing contract that are will be replaced under this procurement: • CSVS: 63NLRB19F0106 • AT&T Expires 3/18/25",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "A.3",
    "text": "NLRB plans to replace this service on a like-for-like or equivalent basis where required, and to utilize transformative services and or options to be incrementally implemented to support overarching agency objectives where possible.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "A.3",
    "text": "The task order (TO) awarded will include the telecommunications service functionality described in this solicitation.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "Service"
  },
  {
    "section_id": "A.4",
    "text": "Although the majority of our existing security panels do not support sending alerts o via ethernet to our monitoring provider, all new panels will have that capability.",
    "type": "Informative",
    "confidence": 0.7,
    "category": "Technical"
  },
  {
    "section_id": "A.4",
    "text": "Since these services are no longer being provided under the GSA EIS contract, we are procuring replacement services outside of the EIS contract The Contractor shall provide POTS service, or equivalent, including installation and DMARC extension at all field offices and headquarters (see attachment J2 NLRB Offices POTS Service Locations).",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "A.4",
    "text": "The Contractor shall also provide all personnel, transportation, equipment, tools, materials, supplies, installation, management, supervision, engineering, maintenance, testing, and services necessary to make circuits/services fully operational and to perform all tasks and functions as defined in this solicitation.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "A.5",
    "text": "Based on recent office moves, we expect that two to five office locations will relocate in each year of this contract and approximately 50% of those will be removed from this TO.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "A.5",
    "text": "NLRB anticipates that during the period of performance of this TO, some NLRB office locations will change.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "Service"
  },
  {
    "section_id": "A.5",
    "text": "Offeror must provide comprehensive training and documentation to ensure NLRB o staff are familiar with the new equivalent solution and can effectively manage and troubleshoot any common issues.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Training"
  },
  {
    "section_id": "A.5",
    "text": "Required Capabilities • Offeror must provide a turn-key solution for each NLRB location • Offeror must be able to complete the transition within 60 days of contract award • For each NLRB Field Office location listed in attachment J2, Offeror must provide a single Plain Old Telephone Service (POTS) line [analog] or equivalent This includes installation of the proposed solution to the appropriate room where the o security panel is located which includes the DMARC extension if required Offeror must also ensure that each security panel is operational as part of the o installation process • If an equivalent solution is proposed: Offeror must ensure that security and bug fixes/patching shall be maintained and kept o up to date on any proposed IT equipment.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "A.5",
    "text": "Service continuity and changes will be managed within allowable thresholds.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "Service"
  },
  {
    "section_id": "A.5",
    "text": "The Contractor shall also provide all personnel, transportation, equipment, tools, materials, supplies, installation, management, supervision, engineering, maintenance, testing, and services necessary to make circuits/services fully operational and to perform all tasks and functions as defined in this solicitation i.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "A.5",
    "text": "The TO will provide service to all existing NLRB locations listed in the NLRB Field Office location list attachment as well as any future sites.",
    "type": "Informative",
    "confidence": 0.7,
    "category": "Service"
  },
  {
    "section_id": "A.5",
    "text": "The equivalent solution must have built-in battery backup o The equivalent solution must be a fully managed service o The intent of this new Task Order is to maximize the benefits and minimize the costs.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "A.5",
    "text": "These office moves may have to be supported under this TO but will probably include new security panels which will allow sending alerts via ethernet or cellular service which will allow them to be removed from this TO.",
    "type": "Informative",
    "confidence": 0.7,
    "category": "Technical"
  },
  {
    "section_id": "A.6",
    "text": "Security Requirements The contractor shall comply with Section 52.239-9000 Information Technology Security Requirements (March 2021) listed under Section I Contract Clauses.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "A.7",
    "text": "Alternative Solutions Contractors are directed to submit proposals that provide the best value solution responses for meeting the requirements of this solicitation.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "A.7",
    "text": "Proposals with alternative approaches should contain a detailed description of the solution and pricing that uses fixed price CLINs whenever possible.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "A.7",
    "text": "The contractor’s proposed price model shall clearly map to the requirements of this solicitation, as instructed in of this solicitation.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "B",
    "text": "Packaging and Marking Preservation, packaging, and packing for all items delivered shall be in accordance with commercial best practices and adequate to insure acceptance by common carrier and safe arrival at destination.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "B",
    "text": "Protections afforded to packaging and marking shall also ensure secure shipment and transportation of materials as to ensure products placed in shipment or transportation process are not tampered with, accessed, damaged or compromised in any fashion.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Process"
  },
  {
    "section_id": "B",
    "text": "Sufficient insurance and carrier guarantees shall also be applied to materials delivered under the terms and conditions of this contract.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "B",
    "text": "The Offeror shall place the contract number on or adjacent to the exterior shipping label.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "C",
    "text": "Inspection and Acceptance The NLRB Point of Contact (POC) that will perform the inspection and acceptance of supplies and services shall be identified in each location.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "C",
    "text": "The NLRB shall provide the offeror with an acceptance determination of any supplies and services in writing.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "C",
    "text": "Unless otherwise specified, the acceptance determination shall be provided within 30 days of receipt of any supplies and services.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "C.4",
    "text": "Corrective-action process, if necessary. • The final transition plan submitted within 10 calendar days of award should provide additional detail to include all of the steps required to implement the proposed solution that includes a detailed section for each NLRB location.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Process"
  },
  {
    "section_id": "C.4",
    "text": "The Contractor shall coordinate implementation and work schedules with other parallel services and the agency’s current service provider and other support contractors that may have direct impact to the timely implementation of their proposed solution • The Contractor shall assign an experienced transition project manager(s) to manage all aspects of the transition and to transfer knowledge, tools, documentation, equipment, processes and methodology from the current provider to the new provider and their team, if necessary. • The transition approach submitted with its proposal shall include: a.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Process"
  },
  {
    "section_id": "C.4",
    "text": "The Contractor shall describe a logical and methodological sequence of events needed to effectively complete transition and implementation.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Process"
  },
  {
    "section_id": "C.4",
    "text": "The Contractor shall develop a comprehensive transition approach to ensure a complete transition of NLRB’s services from the existing provider within 10 days or less of contract award.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Process"
  },
  {
    "section_id": "C.4",
    "text": "The Contractor shall provide a transition approach with its proposal and a final transition plan within 10 calendar days of award.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Process"
  },
  {
    "section_id": "C.4",
    "text": "The Contractor shall support NLRB’s transition in accordance with the requirements described below • The Contractor shall provide and manage a detailed transition plan to ensure that the new services are in place in a thorough and orderly manner.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "C.4",
    "text": "The offeror shall describe how it will ensure a superior customer experience and customer support throughout the transition.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "D.3",
    "text": "Offerors should conduct their own research to confirm the type of building where each office is located. − NLRB has approximately 2-5 office moves per year where most moves are from commercial buildings to a Federal Government-owned building − NLRB is unable to confirm if site surveys or internal wiring will be required for our existing locations and this will need to be determined by each offeror. − All NLRB locations are standard office spaces with between five (5) and fifty (50) employees with standard working hours from Monday to Friday, 9 am – 6 pm local time. − Primary Local Contact Name (PCON) and alternative Local Contact Name (LCON) will be provided after the award.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Compliance"
  },
  {
    "section_id": "D.4",
    "text": "Delivery Schedule The contractor shall provide the following deliverables: Deliverable Deliverable Due Date Deliver To Transition Plan 10 days from award deliverable must be submitted, accepted and approved, to the , contracting officer’s representative (COR) service access 30 days from award deliverable must be submitted, accepted and approved, to the , contracting officer’s representative (COR)",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "E",
    "text": "INVOICING REQUIREMENTS The invoice at a minimum should include: • Name and address of the contractor • Invoice date and number • Order number • Description, quantity, unit of measure, unit price and extended price of the items delivered or services rendered; and • Name, title, and phone number of person to notify in the event of defective invoice.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "If the COR persists and there still exists a disagreement as to the proper contractual coverage, the CO will be notified immediately, preferably in writing. 14.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "If the Contractor is unable to comply with the requirement to use IPP for submitting invoices for payment, the Contractor must submit a waiver request in writing to the Contracting Officer with its proposal or quotation. (End of Clause)",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Compliance"
  },
  {
    "section_id": "E",
    "text": "In addition, the COR will NOT supervise, direct, or control contractor employees.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "NLRB Clause: IPP-001 Electronic Invoicing and Payment Requirements – Invoice Processing Platform (IPP) Payment requests must be submitted electronically through the U.S.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "Notwithstanding this provision, to the extent that the contractor accepts any direction that constitutes a change to this contract/task order without prior written authorization of the CO, costs incurred in connection therewith are incurred at the sole risk of the contractor, and if invoiced under this task order will be disallowed.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "On all matters that pertain to the contract terms, the contractor must communicate with the CO.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "The Contractor Government Business Point of Contact (as listed in SAM) will receive enrollment instructions via email from the Federal Reserve prior to the contract award date, but no more than 3 – 5 business days of the contract award date.",
    "type": "Informative",
    "confidence": 0.6,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "The Contractor must use the IPP website to register, access and use IPP for submitting requests for payment.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "To constitute a proper invoice, the payment request must comply with the requirements identified in the applicable Prompt Payment clause included in the contract, or the clause 52.212-4, Contract Terms and Conditions – Commercial items included in commercial item contracts.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Compliance"
  },
  {
    "section_id": "E",
    "text": "Under NO circumstances is the COR authorized to effect any changes in the work required under this contract/task order, enter into any agreement that has the effect of changing the terms and conditions of this task order, or that causes the contractor to incur costs.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "E",
    "text": "Whenever, in the opinion of the contractor, the COR requests efforts beyond the terms of the contract, the contractor shall so advise the CO.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "F",
    "text": "Additionally, the contractor shall provide a certification that all government information has been properly sanitized and purged from contractor-owned systems, including backup systems and media used during contract performance. • The Contractor (and/or any subcontractor) shall perform, document, and make available to OCIO the actions identified in Employee Separation Checklist when an employee terminates work under this contract within 5 calendar days (or as otherwise specified by the Program Office) of the employee’s exit from the contract.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Service"
  },
  {
    "section_id": "F",
    "text": "Contractor (and/or any subcontractor) shall be responsible for: • Following secure coding best practice requirements, as directed by the United States Computer Emergency Readiness Team (US-CERT) specified standards and the Open Web Application Security Project (OWASP) that shall limit system software vulnerability exploits • Ensuring IT applications designed and developed for end users (including mobile applications and software licenses) run in the standard user context without requiring elevated administrative privileges • Ensuring that computer software developed on behalf of NLRB or tailored from an open-source product, is fully functional and operates correctly on systems configured in accordance with government policy and federal configuration standards.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "DESCRIPTION OF THE INFORMATION SYSTEM DEVELOPMENT ENVIRONMENT AND ENVIRONMENT IN WHICH THE SYSTEM IS INTENDED TO OPERATE OCIO staff is responsible for ensuring that special physical security or environmental security requirements are implemented for facilities and equipment used for processing, transmitting, or storing sensitive information based on the level of risk.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "Destruction of information and/or data shall be accomplished in accordance with NIST SP 800- 88, Guidelines for Media Sanitization • Privacy Act Requirements – if performance of this contract has been determined to involve the design, development, or operation of a system of records on individuals, the contractor shall comply with the Privacy Act of 1974, and complete all NLRB Privacy Impact Assessment requirements.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "Following and adhering to NIST SP 800-37, at a minimum, for system development and provide system documentation at designated intervals (specifically, at the expiration) providing all required documentation, as part of contract closeout and at expiration of the contract, as specified by the OCIO, to designated officials to certify that, at the government’s direction, all electronic and paper records are appropriately disposed of and all devices and media are sanitized in accordance with NIST SP 800-88, Guidelines for Media Sanitization • The contractor (and/or any subcontractors) shall return all government information and IT resources (in nongovernment-owned systems, media, and backup systems) acquired during the term of this contract to OCIO.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "In addition, all products or systems using the Internet Protocol shall maintain operability with both IPv4 and IPv6 • The contractor (and/or any subcontractor) shall ensure secure protocols by utilizing HTTPS only, with HSTS for internal and external websites SECURITY ASSURANCE REQUIREMENTS The following security assurance requirements apply to the performance of this contract: • The contractor (and/or any subcontractor) shall develop and maintain a system security architecture, which includes effective network segmentation design and solutions to limit lateral movement across systems on NLRB’s networks • The contractor (and/or any subcontractor) shall certify that applications are fully functional and operate correctly as intended on systems using baselines such as the US Government Configuration Baseline (USGCB), DISA Security Technical Implementation Guides (STIGs) or any other NLRB-identified configuration baseline.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "In addition, any deviations or changes to the baseline including the patching of software, maintenance or updates must be approved and documented • The contractor (and/or any subcontractor) shall ensure that all IT equipment (e.g., laptops, desktops, servers, routers, mobile devices, peripheral devices, etc.) used to process information on behalf of NLRB are deployed and operated in accordance with approved security configurations and meet the following minimum requirements: a.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "In addition, the contractor (and/or any subcontractor) shall retire and/or upgrade all software/systems that have reached end-of-life status SECURITY-RELATED DOCUMENTATION REQUIREMENTS The security-related documentation requirements in support of government issuance of security assessment and authorization to operate (ATO) decisions and to support the accurate and consistent application of policies, processes and procedures for systems for performance of the work under this contract are as follows: • The Contractor (and/or subcontractor) shall categorize all systems in accordance with FIPS Publications 199 and 200 and ensure that controls are designed and implemented consistent with the most recent finalized version of NIST SP 800-53, Recommended Security Controls for Federal Information Systems and Organizations • The contractor (and/or subcontractor) shall develop and maintain documentation per NIST Risk Management Framework guidance, including but not limited to: a.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "In addition, the contractor shall support a system of records in accordance with any PIAs required and generated by any PTAs, and any applicable System of Record Notices (SORNs), in conjunction with the judgment of the Privacy Office, and NLRB-approved records and retention schedule(s) and protection requirements for federal agencies • Risk Management Framework for Information Systems and Organizations: A System Life Cycle Approach for Security and Privacy.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "Information which, either alone or when compared with other reasonably available information, is deemed sensitive or proprietary by NLRB shall be protected as instructed in accordance with the magnitude of the loss or harm that could result from inadvertent or deliberate disclosure, alteration, or destruction of the data.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "F",
    "text": "No sensitive data shall be used during software testing • Protecting information that is deemed sensitive from unauthorized disclosure to persons, organizations, or subcontractors who do not have a need to know.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "Privacy Impact Analysis (PIA) • The contractor (and/or subcontractor) shall have an independent third-party validate the security and privacy controls in place for the system(s) and report on technical, operational, and management level deficiencies as outlined in NIST SP 800-53.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "SECURITY FUNCTIONAL REQUIREMENTS The contractor (and/or any subcontractor) shall comply with all Federal and National Labor Relations Board (NLRB) security functional requirements, including but not limited to, the regulations and guidance found in the following: • Federal Information Security Modernization Act of 2014 (FISMA) • Privacy Act of 1974 • E-Government Act of 2002 • National Institute of Standards and Technology (NIST) Special Publications (SP) including NIST SP 800-37, 800-53, and 800-60 Volumes I and II • Federal Information Processing Standards (FIPS) Publications 140-3, 199, and 200 • Office of Management and Budget (OMB) Circular A-130 • Federal Risk and Authorization Management Program (FedRAMP) • National Labor Relations Board “Dash 1” (-1) Policies for NLRB and NLRB systems • National Labor Relations Board Administrative Policies and Procedures Manuals (APPMs) SECURITY STRENGTH REQUIREMENTS The following security strength requirements shall be met during the performance of this contract: • The contractor (and/or any subcontractor) shall protect all government information that is or may be sensitive in accordance with FISMA by securing it with a FIPS 140-3 validated solution • The contractor (and/or any subcontractor) shall ensure that systems/products/applications have the ability to facilitate single-sign-on capabilities and required support for HSPD-12 Personal Identity Verification (PIV) enablement and integration • The contractor (and/or any subcontractor) shall implement remote access solutions that use multi-factor authentication solutions and that prohibit the use of split tunneling and/or dual- connected remote hosts where the connecting device has two active connections • The contractor (and/or any subcontractor) shall implement capabilities for all incoming email traffic to be analyzed using sender authentication protocols, e.g., DKIM, DMARC, VBR, SPF • The contractor (and/or any subcontractor) shall ensure that all systems, including hardware, software, firmware, and/or network components developed, procured, or acquired in support and/or performance of any contract using the Internet Protocol are formatted in accordance with commercial standards of Internet Protocol version 6 (IPv6) as set forth in the USGv6 Profile (NIST Special Publication 800-119).",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "Safeguarding Controlled Unclassified Information (CUI) - CUI is defined as “information that laws, regulations, or Government-wide policies require to have safeguarding or dissemination controls, excluding classified information.” These include, but are not limited to: • Complying with Executive Order 13556, Controlled Unclassified Information, (implemented at 32 CFR, part 2002) when handling Controlled Unclassified Information, including but not limited to, marking, safeguarding, transporting, disseminating, reusing, and disposing of the information. • All sensitive information that has been identified as CUI by a regulation or statute, handled by this solicitation/contract, shall be: a.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Compliance"
  },
  {
    "section_id": "F",
    "text": "The contractor shall address all “high” deficiencies, and any other deficiency requiring contractor mitigation as identified by the Program Office, before submitting the package to NLRB for acceptance • The contractor (and/or subcontractor) shall develop and maintain Plan of Actions and Milestones (POA&Ms) for all remaining deficiencies to be reviewed by NLRB Contracting Officers and the Office of the Chief Information Officer (OCIO) staff for security compliance and ensure that system weaknesses are captured in the POA&Ms.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "The contractor shall assist OCIO Privacy staff with conducting a Privacy Threshold Analyses (PTA) on systems used to collect information on individuals or when NLRB develops, acquires, or buys new systems to handle collecting information in identifiable form to determine whether or not a full Privacy Impact Assessment (PIA) needs to be completed • OCIO staff/System Owners should provide advice and assistance to NLRB Contracting Officers identifying additional security requirements for system software, networks and applications REQUIREMENTS FOR PROTECTING SECURITY-RELATED DOCUMENTATION Contractor (and/or any subcontractor) shall be responsible for complying with all NLRB security requirements including applicable federal laws, Executive Orders, directives, policies, regulations, and industry standards.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "The contractor shall test applicable products and versions with all relevant and current updates and patches updated prior to installing in the NLRB environment.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "General"
  },
  {
    "section_id": "F",
    "text": "The preliminary notice does not commit the Government to an extension. (b) If the Government exercises this option, the extended contract shall be considered to include this option clause. (c) The total duration of this contract, including the exercise of any options under this clause, shall not exceed 5 years. 52.239-9000 Information Technology Security Requirements (March 2021) In the performance of this contract, the contractor shall comply with the following information technology (IT) security requirements.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  },
  {
    "section_id": "F",
    "text": "Using Security Content Automation Protocol (SCAP)-validated tools with USGCB Scanner capabilities to scan its systems at least on a monthly basis and report the results of these scans to the CO and/or COR, Project Officer, and any other applicable designated point of contact • The Contractor shall provide all information from any managed systems to NLRB, as requested, and shall assist, as needed, to perform periodic vulnerability assessments of the network, operating systems, and applications to identify vulnerabilities and propose mitigations • The contractor (and/or any subcontractor) shall include actions and initiatives to implement the NIST Cybersecurity Framework that emphasizes and measures capabilities to “Identify, Protect, Detect, Respond, and Recover,” and ensure that all applicable Service Level Agreements (SLAs), Interconnection Security Agreement (ISA) or Memorandum of Agreement/Understanding (MOA/U) are adhered to, complied with, and satisfied • The contractor (and/or any subcontractor) shall use Commercial off the Shelf (COTS) software or other software that is supported by the manufacturer.",
    "type": "Mandatory",
    "confidence": 0.8,
    "category": "Technical"
  }
]